apache/mynewt-core/hw/mcu/nxp/src/ext/nxp-kinetis-sdk/drivers/fsl_ltc_dpa.h
/*******************************************************************************
 * CMAC API
 ******************************************************************************/

/*!
 * @internal @addtogroup ltc_driver_cmac_with_dpa
 * @{
 */
/*!
 * @brief Initialize CMAC context
 *
 * This function initialize the CMAC.
 * Key shall be supplied because the underlaying algoritm is AES XCBC-MAC or AES CMAC.
 *
 * For XCBC-MAC, the key length must be 16. For CMAC, the key length can be
 * the AES key lengths supported by AES engine.
 *
 * @param base LTC peripheral base address
 * @param handle pointer to ltc_dpa_handle_t structure which stores the transaction state.
 * @param algo Underlaying algorithm to use for hash computation.
 * @param key Input key (NULL if underlaying algorithm is SHA)
 * @param keySize Size of input key in bytes
 * @return Status of initialization
 */
status_t LTC_CMAC_InitDPA(
    LTC_Type *base, ltc_dpa_handle_t *handle, ltc_dpa_hash_algo_t algo, const uint8_t *key, size_t keySize);

/*!
 * @brief Add data to current CMAC
 *
 * Add data to current CMAC. This can be called repeatedly with an arbitrary amount of data to be
 * hashed.
 *
 * @param base LTC peripheral base address
 * @param handle pointer to ltc_dpa_handle_t structure which stores the transaction state.
 * @param message Input data
 * @param messageSize Size of input data in bytes
 * @return Status of the hash update operation
 */
status_t LTC_CMAC_UpdateDPA(LTC_Type *base, ltc_dpa_handle_t *handle, const uint8_t *message, size_t messageSize);

/*!
 * @brief Finalize hashing
 *
 * Outputs the final hash and erases the context.
 *
 * @param base LTC peripheral base address
 * @param handle pointer to ltc_dpa_handle_t structure which stores the transaction state.
 * @param[out] output Output hash data
 * @param[out] outputSize Output parameter storing the size of the output hash in bytes
 * @return Status of the hash finish operation
 */
status_t LTC_CMAC_FinishDPA(LTC_Type *base, ltc_dpa_handle_t *handle, uint8_t *output, size_t *outputSize);

/*!
 * @brief Create CMAC on given data
 *
 * Perform the full keyed CMAC in one function call.
 *
 * @param base LTC peripheral base address
 * @param handle pointer to ltc_dpa_handle_t structure which stores the transaction state.
 * @param algo Block cipher algorithm to use for CMAC creation
 * @param input Input data
 * @param inputSize Size of input data in bytes
 * @param key Input key
 * @param keySize Size of input key in bytes
 * @param[out] output Output hash data
 * @param[out] outputSize Output parameter storing the size of the output hash in bytes
 * @return Status of the one call hash operation.
 */
status_t LTC_CMAC_DPA(LTC_Type *base,
                      ltc_dpa_handle_t *handle,
                      ltc_dpa_hash_algo_t algo,
                      const uint8_t *input,
                      size_t inputSize,
                      const uint8_t *key,
                      size_t keySize,
                      uint8_t *output,
                      size_t *outputSize);
/*!
 *@}
 */ /* end of ltc_driver_cmac_with_dpa */

/*! @}*/ /* end of ltc_driver_dpa */

#if defined(__cplusplus)
}
#endif

#endif /* _FSL_LTC_DPA_H_ */
